create_clock -period 50 [get_ports clk]
set_clock_uncertainty -setup 1.5 [get_clocks clk]
set_input_delay -max 25 -clock clk [all_inputs]
set_output_delay -max 3 -clock clk [all_outputs]
